import streamlit as st 

import datetime

st.title ("منصة تسجيل بيانات المستخدمين")

name = st.text_input("الاسم الرباعي")

id = st.text_input("رقم الهوية/الاقامة", max_chars=10, help="أدخل 10 أرقام")

birth = st.date_input(
    "تاريخ الميلاد",
    value=datetime.date(2000, 1, 1),
    min_value=datetime.date(1920, 1, 1),
    max_value=datetime.date.today()
)


phone = st.text_input("رقم الجوال", placeholder="05XXXXXXXX", max_chars=10)

email = st.text_input("البريد الالكتروني")

uni = st.selectbox(
"الجامعة"
,
["جامعة الملك فيصل" , "جامعة الملك عبدالعزيز" , "جامعة الملك سعود" , "جامعة الملك فهد للبترول والمعادن " , "جامعة الملك عبدالله للعلوم والتقنية" , "جامعة ام القرى" , "جامعة الامام عبدالرحمن بن فيصل " , "جامعة الملك خالد" , "جامعة الاميرة نوره بنت عبدالرحمن" , "جامعة الملك عبدالعزيز" , "جامعة الملك سعود" , "جامعة الملك فهد للبترول والمعادن " , "جامعة الملك عبدالله للعلوم والتقنية" , "جامعة ام القرى" , "جامعة الامام عبدالرحمن بن فيصل " , "جامعة الملك خالد" , "جامعة الاميرة نورة بنت عبدالرحمن" , "الجامعة الاسلامية بالمدينة المنورة" , "جامعة الإمام محمد بن سعود الإسلامية" , "جامعة نايف العربية للعلوم الامنية" , "جامعة القصيم " , "جامعة طيبة" , "جامعة الطائف" , "جامعة حائل" , "جامعة جازان" , "جامعة الجوف" , "جامعة الباحة" , "جامعة تبوك" , "جامعة نجران" , "جامعة الحدود الشمالية" , "جامعة الملك سعود بن عبدالعزيز للعلوم الصحية" , "جامعة الامير سطام بن عبدالعزيز" , "جامعة شقراء" , "جامعة المجمعة" , "الجامعة السعودية الالكترونية" , "جامعة جدة" , "جامعة بيشة" , "كلية المدربين التقنيين " , "جامعة حفر الباطن" , "كلية الجبيل الصناعية" , "كلية ينبع الصناعية" , "كلية ينبع الجامعية" , "كلية الجبيل الجامعية" , "جامعة الرياض للفنون" ]
)

degree = st.selectbox(
"الدرجة العلمية"
,
[ "دبلوم متوسط" , "دبلوم دراسات عليا" , "دبلوم عالي" , "التعليم المتوسط" , "التعليم الابتدائي" , "دكتوراه" , "ماجستير" , "بكالوريوس" , "دبلوم" , "الثانوية العامة"]
)

exp = st.number_input("سنوات الخبرة" , min_value = 0 , max_value = 40)

skills = st.multiselect(
"المهارات"
,
["العمل الجماعي" , "حل المشكلات " , "التسويق" , "ادارة المشاريع" , "تحليل البيانات" , "البرمجة" , "كتابة تقارير" , " الادارة الذاتية" , "التواصل والتنسيق" , " الابداع " , "التنوع والذكاء الثقافي" , "التفكير التحليلي " , "الإلمام بالبيانات " , "استخدام التكنولوجيا" , " الذكاء العاطفي " , " المبادرة" , "القيادة والتاثير الاجتماعي" , "تحقيق الموازنة " , "التواصل والاستماع" , "الرؤية والتخطيط" , " تحليل الاعمال" ]
)

lang = st.multiselect(
"اللغات"
,
["العربية" , "الإنجليزية" , "الصينية" , "الهندية" , "الإسبانية" , "الفرنسية" , "الألمانية" , "الروسية" , "اليابانية" , "البرتغالية" ]
)

if st.button("تسجيل"):
    if ( 
        name == "" or 
        id == "" or 
        birth == "" or
        phone == "" or 
        email == "" or
        uni == "" or
        degree == "اختر المؤهل"
    ):
        st.error("يجب تعبئة جميع البيانات") 
    elif len(phone) != 10 or not phone.startswith("05"):
        st.error("رقم الجوال غير صحيح")
        
    elif "@" not in email:
        st.error("البريد الالكتروني غير صحيح")
    
    elif len (skills) < 3:
        st.error("يجب اختيار 3 مهارات على الاقل")

    else:
        
            
        st.success("تم التسجيل بنجاح")
    
        st.write("البيانات المدخلة:")
        st.write("الاسم:" , name)
        st.write("رقم الهوية:" , id)
        st.write("رقم الجوال:" , phone)
        st.write("المؤهل:" , degree)
        st.write("سنوات الخبرة:" ,exp)
        st.write("المهارات:" , skills)

    

    




